app/controllers/books_controller.rb

    def index
        if params[:category].blank?
        @books = Book.all.order("created_at DESC")
        else
            @category_id = Category.find_by(name: params[:category]).id
            @books = Book.where(:category_id => @category_id)
---
SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books"  ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Programming Books"]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ?  [["category_id", 7]]

    def show
        if @book.reviews.blank?
            @average_review = 0

        else
            @average_review = @book.reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 19]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 19]]

    def new
        @book = current_user.books.build #creating new books from current user session.
        @categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

    def create
        @book = current_user.books.build(book_params)
        @book.category_id = params[:category_id]
        if @book.save
---
INSERT INTO "books" ("title", "descriptions", "author", "book_img_file_name", "book_img_content_type", "book_img_file_size", "book_img_updated_at", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
         @book.category_id = params[:category_id]
        if @book.update(book_params)
---
UPDATE "books" SET "book_img_file_size" = ?, "book_img_updated_at" = ?, "book_img_file_name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["book_img_file_size", 51157], ["book_img_updated_at", "2015-10-29 23:21:32.545143"], ["book_img_file_name", "sword-of-the-spirit.jpg"], ["updated_at", "2015-10-29 23:21:33.126902"], ["id", 7]]