app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        @review = Review.new(review_params)
        @review.book_id = @book.id
        @review.user_id = current_user.id
        if @review.save

UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 4], ["updated_at", "2015-10-30 17:09:49.254442"], ["id", 1]]
---
    def update

        if @review.update(review_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 18]]
---
    def find_book
        @book = Book.find(params[:book_id])